# GOA in pyhton 


def goa_registration():
    print("""
    ======================================
    💚 Welcome to Goal Oriented Academy 💚
    ======================================""")
    print("""
    საქართველოში ყველაზე სანდო და ერთადერთი აკადემია,
    რომელიც პერსონალურად მოგიდგება და დაგეხმარება ნებისმიერი ცხოვრებისეული პრობლემის 
    მოგვარებაში. ჩვენთან დაისახე დიადი მიზნები და ერთად მივაღწიოთ მათ
    """)
    print("მაგრამ სანამ GOA-ს წევრი გახდები, საჭიროა რეგისტრაცია. რეგისტრაციის პროცესში გთხოვთ შეიყვანოთ თქვენი სრული ინფორმაცია.")

    # პირადი ინფორმაცია
    print(" პირადი მონაცემები:")

    name = input(" შეიყვანე შენი სახელი: ")
    if len(name) == 0:
        print(" ველი ცარიელია! რეგისტრაცია ვერ განხორციელდება.")
        return 

    surename = input(" შეიყვანე შენი გვარი: ")
    if len(surename) == 0:
        print(" ველი ცარიელია! რეგისტრაცია ვერ განხორციელდება.")
        return

    user_age = int(input(" შეიყვანე შენი ასაკი: "))
    if user_age < 7:
        print(" GOA-ში მინიმალური ასაკი სწავლის დაწყებისთვის არის 7 წელი თქვენ ვერ დარეგისტრირდებით GOA-ში")
        return

    user_tel = input(" შეიყვანე შენი ტელეფონის ნომერი: ")
    if len(user_tel) != 9:
        print(" ველი ცარიელია ან არასრული! რეგისტრაცია ვერ განხორციელდება.")
        return

    email = input("✉️  შეიყვანე შენი ელფოსტა: ")
    if "@gmail.com" not in email:
        print(" email-ი არასწორეა! რეგისტრაცია ვერ განხორციელდება.")
        return

    print("")

    # მშობლის ინფორმაცია
    print(" მშობლის ინფორმაცია:")

    farent_name = input(" მშობლის სახელი: ")
    if len(farent_name) == 0:
        print(" ველი ცარიელია! რეგისტრაცია ვერ განხორციელდება.")
        return

    farent_surename = input(" მშობლის გვარი: ")
    if len(farent_surename) == 0:
        print(" ველი ცარიელია! რეგისტრაცია ვერ განხორციელდება.")
        return

    farent_tel = input(" მშობლის ტელეფონის ნომერი: ")
    if len(farent_tel) != 9:
        print(" ველი ცარიელია! რეგისტრაცია ვერ განხორციელდება.")
        return

    # სოციალური ქსელი
    fb_link = input(" მშობლის Facebook - ლინკი(არასავალდებულო): ")

    print(" პირადი ინფორმაციის რეგისტრაცია დასრულებულია! ყველაფერი სწორად შეიყვანეთ.")


goa_registration()  


# გვანცა მაზანიშვილი

print("ჩვენ გთვაზობთ მრავალ საგნებს. მათ შორის: მატემატიკა, ინგლისური, ხელოვნური ინტელექტი და ალგორითმები, გრაფუკული დიზაინი და თავისუფალი ჩხუბი - MMA")

print("იმისთვის რომ გავარკვიოთ რამდენად კარგად იცი შენთვის დაინტერესებული საგანი გავიაროთ პატარა ქვიზი.")

print("")

print("1. მათემატიკა - math")
print("2. ინგლისური - english")
print("3. პროგრამირება - programming ")
print("4. თავისუფალი ჩხუბი - MMA")
print("5. გრაფუკული დიზაინი - graphic design")
print("6. საწყისი დონე და გამოცდა - basic course and exam")
print("7. როლები GOA-ს აკადემიაში - roles in GOA academy")
print("8. ჰაკათონი - hackhathon")
print("9. გადახდა - payment")
print("10. სწავლის ტიპები - learning types")
print("11. ასაკოვანი ზღვარი - Age limit")





print("")
choice = input("აირჩიე შენთვის სასურველი კურსის ქვიზი: ")


# ენრი შაქარიძე

def quiz_math():
    score = 0
    print("🧮 მოგესალმები მათემატიკის Quiz-ში!")

    print("ყურადღებით წაიკითხე თითოეული დავალება და აირჩიე სწორი პასუხი (ა, ბ, გ, დ)")
    print("")

    # 1
    print("1) გამოთვალეთ მოცემული მაგალითი: ")
    print("555 + 555 + 123 = ?")
    print("ა) 1223;  ბ) 1103;  გ) 1233;  დ) 1123")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 2
    print("2) გამოთვალეთ მოცემული ნამრავლი: ")
    print("15 × 12 = ?")
    print("ა) 180;  ბ) 1164;  გ) 172;  დ) 162")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 3
    print("3) გამოთვალეთ მოცემული გაყოფა: ")
    print("50 ÷ 5 = ?")
    print("ა) 45;  ბ) 5;  გ) 10;  დ) 15")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 4
    print("4) გამოთვალეთ მოცემული მგალითი: ")
    print("რამდენია 5² -ი?")
    print("ა) 15;  ბ) 8;  გ) 125;  დ) 25")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "დ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 5
    print("5) გამოთვალეთ მოცემული სხვაობა: ")
    print("693 - 54 = ?")
    print("ა) 747;  ბ) 639;  გ) 3742;  დ) 654")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 6
    print("6) გამოთვალეთ მოცემული მაგალითი: ")
    print("როგორ იწერება 1/4 ათწილადად?")
    print("ა) 0.25;  ბ) 0.75;  გ) 1.4;  დ) 0.14")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 7
    print("7) გამოთვალეთ მოცემული მაგალითი: ")
    print("x - 2 = 2 რას უდრის x ?")
    print("ა) 6;  ბ) 0;  გ) 3;  დ) 4")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "დ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 8
    print("😎 გამოთვალეთ მოცემული მაგალითი: ")
    print("10 + x = 30 რას უდრის x ?")
    print("ა) 20;  ბ) 10;  გ) 40;  დ) 30")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 9
    print("9) გამოთვალეთ მოცემული განაყოფი: ")
    print("2500 ÷ 2 = ?")
    print("ა) 5000;  ბ) 1250;  გ) 1500;  დ) 2250")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 10
    print("10) გამოთვალეთ მოცემული მაგალითი: ")
    print("100 × (3/5) = ?")
    print("ა) 60;  ბ) 65.5;  გ) 99.4;  დ) 40")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    if score >= 100:
        level = 'Master level math'
    elif score >= 70:
        level = 'Professional math'
    elif score >= 50:
        level = 'Intermediate math'
    else:
        level = 'Begginer math'

    print(f"შენი დონეა {level}")


# გვანცა მაზანიშვილი 

def programming_quiz():
    score = 0
    print("მოგესალმები პროგრამირების quiz-ში")

    print("ყურადღებით წაიკითხე კითხვები და გაეცი მათ პასუხი")
    print("")

    # 1
    print("რა არის ალგორითმი?")
    print("ა) კომპიუტერული პროგრამა ბ) ბრძანებების თანმიმდევრობა პრობლემის გადასაჭრელად გ) პროგრამირების ენა დ) კომპიუტერის ოპერაციული სისტემა")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    # 2
    print("რომელი მათგანი არის პროგრამირების ენა?")
    print("ა) Microsoft Word ბ) Google Chrome გ) Python დ) Windows")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


    # 3
    print("რას აკეთებს ცვლადი (variable) პროგრამირებაში?")
    print("ა) უცვლელად ინახავს მნიშვნელობას ბ) ინახავს და ინახავს მონაცემებს მეხსიერებაში გ) აშლის პროგრამას დ) ბეჭდავს ტექსტს ეკრანზე")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")



        # 4
    print("რა არის loop-ი (ციკლი)?")
    print("ა) პროგრამის შეცდომა ბ) კოდის ბლოკის განმეორებითი შესრულება გ) პროგრამის დასრულება დ) ახალი ფაილის შექმნა")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 5
    print("რას ნიშნავს debugging?")
    print("ა) პროგრამის დაწერა ბ) შეცდომების პოვნა და გამოსწორება გ) პროგრამის გაშვება დ) კოდის წაშლა")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 6
    print("რომელი სიმბოლო გამოიყენება კომენტარის დასაწერად Python-ში?")
    print("ა) // ბ) /* */ გ) # დ) --")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 7
    print(" რა არის if statement-ის დანიშნულება?")
    print("ა) რიცხვების შეკრება ბ) პირობითი გადაწყვეტილებების მიღება გ) ფაილების შენახვა დ) ინტერნეტთან დაკავშირება")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 8
    print("რა არის function (ფუნქცია)?")
    print("ა) კოდის მრავალჯერადი გამოყენებადი ბლოკი ბ) პროგრამის შეცდომა გ) ფაილის ტიპი დ) კომპიუტერის ნაწილი")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 9
    print("რომელი ოპერატორი გამოიყენება ორი რიცხვის შესაკრებად?")
    print("ა) - ბ) * გ) + დ) /")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


        # 10
    print("რა არის string (სტრინგი)?")
    print("ა) რიცხვი ბ) ტექსტური მონაცემების ტიპი გ) ლოგიკური მნიშვნელობა დ) ციკლის ტიპი")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")
        
        print("")
        if score >= 100:
            level = 'Master level programmer'
        elif score >= 70:
            level = 'Professional programmer'
        elif score >= 50:
            level = 'Intermediate programmer'
        else:
            level = 'Begginer programmer'

    print(f"შენი დონეა {level}")

    

# english quiz - გვანცა მაზანიშვილი


def english_quiz():
    print("იმისთვის რომ გავარკვიოთ რა დონეზე იცი ინგლისური გავიაროთ მარტივი ქვიზი.")
    # 1
    print(" რისთვის გამოიყენება Present Simple დრო?")
    print("ა) ახლა მიმდინარე მოქმედებებისთვის ბ) ჩვევებისთვის, რუტინისთვის და ზოგადი ჭეშმარიტებებისთვის გ) გუშინ მომხდარი მოქმედებებისთვის დ) მომავალი გეგმებისთვის")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "ბ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


    # 2 
    print("რომელი წინადადება არის Past Simple-ში?")
    print("ა) I am eating lunch ბ) I eat lunch every day გ) I ate lunch yesterday დ) I will eat lunch tomorrow")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "გ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")



    # 3
    print(" რა არის არსებითი სახელი (noun)?")
    print("ა) მოქმედების სიტყვა ბ) აღწერითი სიტყვა გ) ადამიანი, ადგილი, ნივთი ან იდეა დ) დამაკავშირებელი სიტყვა")    
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "გ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


    # 4
    print("რომელი სიტყვა არის ზედსართავი სახელი (adjective)?")
    print("ა) Run ბ) Beautiful გ) Quickly დ) And")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "ბ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    # 5
    print("რა არის child-ის მრავლობითი ფორმა?")
    print("ა) Childs ბ) Childes გ) Children დ) Childrens")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "გ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    # 6
    print("რომელი წინადადება იყენებს Present Continuous-ს სწორად?")
    print("ა) She is read a book ბ) She reading a book გ) She is reading a book დ) She read a book")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "გ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


    # 7
    print(": რა არის ზმნა (verb)?")
    print("ა) სიტყვა, რომელიც აღწერს არსებით სახელს ბ) სიტყვა, რომელიც გამოხატავს მოქმედებას ან მდგომარეობას გ) ადამიანის სახელი დ) ადგილის აღმნიშვნელი სიტყვა")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "ბ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    # 8 
    print("რომელი არის სწორი Future Simple ფორმა?")
    print("ა) I go to school tomorrow ბ) I will go to school tomorrow გ) I going to school tomorrow დ) I am go to school tomorrow")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "ბ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    
    # 9
    print("რა არის ზმნიზედა (adverb)?")
    print("ა) სიტყვა, რომელიც აღწერს არსებით სახელს ბ) სიტყვა, რომელიც აღწერს ზმნას, ზედსართავს ან სხვა ზმნიზედას გ) მოქმედების სიტყვა დ) დამაკავშირებელი სიტყვა")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "ბ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    # 10

    print(" რომელი წინადადებაა სწორი?")
    print("ა) He don't like pizza ბ) He doesn't likes pizza გ) He doesn't like pizza დ) He not like pizza")
    answer = input("აირჩიე სწორი პასუხი: ")

    if answer == "გ":
            score += 10
            print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
            score += 0
            print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")


    print("")
    if score >= 100:
        level = 'Master level english'
    elif score >= 70:
        level = 'Professional english'
    elif score >= 50:
        level = 'Intermediate english'
    else:
        level = 'Begginer english'

    print(f"შენი დონეა {level}")



# ენრი შაქარიძე

def mma_page():
    print("🔥 გაატარე შემდეგი სეზონი პროდუქტიულად, შეისწავლე მსოფლიოში ყველაზე მოთხოვნადი და საინტერესო სპორტი — MMA!")
    print("გაიცანი GOA-ს საბრძოლო ხელოვნებების აკადემიის ერთ-ერთი მთავარი მწვრთნელი — Kurtanidze NiKa!")
    print("ნიკა კურტანიძე — მსოფლიოს მრავალგზის ჩემპიონი, მზადაა გაგიზიაროს მისი უდიდესი გამოცდილება MMA-ში 💪")
    print("შემოგვიერთდი GOA-ში და გახდი საუკეთესო მებრძოლი საუკეთესო მწვრთნელების დახმარებით! 🔥")

    print("")

    print("🥊 MMA-ში 2025 წლის ნაკადის მიღება დაიწყო!")
    print("ასაკი: 4-დან 100 წლამდე")
    print("ხანგრძლივობა: 1 საათი და 30 წუთი")

    print("📅 ჯგუფები:")
    print("N1) ორშაბათი, ოთხშაბათი, პარასკევი — 15:00")
    print("N2) სამშაბათი, ხუთშაბათი, შაბათი — 15:00")
    print("N3) შაბათი, კვირა — 13:00 (ასაკი 9-12)")
    print("N4) შაბათი, კვირა — 11:00 (ასაკი 4-8)")
    print("N5) შაბათი 17:00 / კვირა 15:00 (ასაკი 13+)")

    print("თვიური გადასახადი:")
    print("კვირაში 5-ჯერ : 250 ლარი")
    print("კვირაში 4-ჯერ : 220 ლარი")
    print("კვირაში 3-ჯერ : 180 ლარი")
    print("კვირაში 2-ჯერ : 130 ლარი")
    print("კვირაში 1-ჯერ : 70 ლარი")

    print("მისამართი:")
    print("საქართველოს MMA-ს ფედერაციის შენობა, აღმოსავლეთ ევროპის უნივერსიტეტში.")
    print("სარაჯიშვილის მეტროდან ფეხით მხოლოდ 5 წუთის გზაზე")

    print("🧠 შრომა | სწავლა | ბრძოლა 💥")

# ენრი შაქარიძე


def graphic_design():
    print("მათთვის, ვისაც სურს გახდეს დიზაინერი 💡")
    print("იმისათვის, რომ გახდე დიზაინერი, შენ არ გჭირდება სპეციალური ცოდნა.")
    print("საჭიროა მხოლოდ სურვილი — დანარჩენს 'GOA'-ში ნულიდან ისწავლი")
    print("კურსის განმავლობაში მიიღებ თეორიულ ცოდნას და უამრავ პრაქტიკულ გამოცდილებას,")
    print("რაც საშუალებას მოგცემს შექმნა საკუთარი პროექტები და ააწყო სრულფასოვანი პორტფოლიო")
    print("ეს პორტფოლიო იქნება შენი მთავარი ბილეთი დიზაინერის კარიერაში ")
    print("")

    print("რა არის გრაფიკული დიზაინი?")
    print("გრაფიკული დიზაინი არის პროფესია, რომელიც ვიზუალურ გამოსახულებებს იყენებს")
    print("იდეების და გზავნილების გადასაცემად სამიზნე აუდიტორიისთვის ")
    print("დღეს ის ყველგანაა — ბილბორდებზე, შეფუთვებზე, მობილურ აპებში და ვებსაიტებზე")
    print("კომპანიები სწორედ დიზაინერების დახმარებით უკავშირდებიან მომხმარებლებს,")
    print("რეკლამირებენ პროდუქტებს და ქმნიან ბრენდის იდენტობას ")
    print("")

    print("გრაფიკული დიზაინი აერთიანებს ხელოვნებასა და ბიზნესს,")
    print("კრეატიულობასა და კომერციულ მიზნებს — ამიტომ ეს სფერო ერთდროულად საინტერესო და მომგებიანია")
    print("")

    print("თუ ეს მიმართულება გიზიდავს და გინდა ამ სფეროში განვითარება — სწორ ადგილას მოხვდი!")
    print("GOA-ში ისწავლი ყველაფერს, რაც საჭიროა თანამედროვე დიზაინერის კარიერისთვის ")
    print("")
    print("გსურთ გრაფიკული დიზაინის სწავლა?")

    choice = input("აირჩიეთ კი ან არა: ")
    if choice == 'არა':
        print("გასაგებია! შესაძლოა მომავალში დაგაინტერესოს მანამდე შეგიძლია აირჩიო სხვა GOA-ს კურსი.")
        return
    elif choice == 'კი':
        print("კიბატონო სანამ გრაფიკულ დიზაინზე გაწევრიანდები უნდა გაიარო ტესტი")
    else:
        print("არასწორი არჩევანი სცადეთ თავიდან")
        return
    
    print("ყურადღებით წაიკითხე თითოეული დავალება და აირჩიე სწორი პასუხი (ა, ბ, გ, დ)")
    print("")

    score = 0

    # 1
    print("1)რა არის გრაფიკული დიზაინი?")
    print("ა) მხოლოდ ფოტოების გადაღება;  ბ) კოდების წერა; გ) ტექსტის თარგმნა;  დ) ვიზუალური კომუნიკაცია")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 2
    print("2)რომელი პროგრამა გამოიყენება ყველაზე ხშირად გრაფიკულ დიზაინში?")
    print("ა) Microsoft word;  ბ) Adobe Photoshop; გ) Google Chrome;  დ) Zoom")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")


    # 3
    print("3)რომელი პროგრამა გამოიყენება ვექტორული დიზაინისთვის?")
    print("ა)Adobe ilustration ;  ბ) Adobe Premiere; გ) Canva;  დ) After Effects")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 4
    print("4)რა ფუნქქცია აქვს 'color picker'-ს?")
    print("ა)ტექსტის გასაერთიანებლად ;  ბ) ფერის ასარცევად; გ) ფაილის შესანახად;  დ) სურათის წასაშლელად")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 5
    print("5)სად გამოიყენება CMYK ფერების სისტემა ?")
    print("ა)ციფრულ მოწყობილობებში ;  ბ) ბეჭდვის მასალებში; გ) ვიდეოებში;  დ) მუსიკაში")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 6
    print("6)რა არის mockup ?")
    print("ა)მზა ნიმუში ;  ბ) შრიფტის ზომა; გ) ვიდეო კლიპი;  დ) ტექსტის ჩარჩო")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 7
    print("7)რას ნიშნავს RGB ?")
    print("ა)Red, green, blue ;  ბ) right, gray, black; გ) Random grafhic Base;  დ) Red Good Bacground")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ა":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 8
    print("8)რა ფუნქცია აქვს opacity-ს ?")
    print("ა)ტექსტის ზომა ;  ბ) ფონის ფერი; გ) გამჭირვალეობის რეგურილება;  დ) გამოსახულების რეზოლუცია")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "გ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 9
    print("9)რას ნიშნავს branding ?")
    print("ა)ფერების შერჩევა შემთხვევით;  ბ) ბრენდის იდენტობის შექმნა ; გ) მხოლოდ სლოგანის შექმნა ;  დ) ფოტოების კოლაჟი")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")

    # 10
    print("9)რა არის contrast diზაინში?")
    print("ა)ობიექტის ერთიანობა;  ბ) განსხვავება ფერებისა და ელემენტებს შორის ; გ) ფერის მუქი ტონი ;  დ) შრიფტის ზომა")
    answer = input("აირჩიე სწორი პასუხი: ")
    if answer.lower() == "ბ":
        score += 10
        print(f"თქვენი არჩევანი '{answer}' სწორია ✅. ამჟამინდელი ქულების რაოდენობაა {score}")
    else:
        score += 0
        print(f"თქვენი არჩევანი '{answer}' არასწორია ❌. ამჟამინდელი ქულების რაოდენობაა {score}")

    print("")
    if score >= 100:
        level = 'Master level designer'
    elif score >= 70:
        level = 'Professional designer'
    elif score >= 50:
        level = 'Intermediate designer'
    else:
        level = 'Begginer designer'

    print(f"შენი დონეა {level}")

# გვანცა მაზანიშვილი
def basic_course():
    print("GOA-ს აკადემიაში საწყისი დონე არის 100 გაკვეთილი")
    print("100 ჩატარებული გაკვეთილის მერე ბავშვბეი იკრიბებიან ერთად და აბარებენ გამოცდას")
    print("მათ გადაეცემათ სერთიპიკატი რომლიც იმის მანიშნებელია რომ მათ წარმატებით დაასრულეს საწყისი დონე")
    print("ამ გამოცდის ჩაბარების შემდეგ მათ ექნებათ პროფესიონალური გასაუბრებო GOA-ს დირექტორთან")
    print("ბატონ ნიკა კეშელავასთან ")
    print("ამის შემდეგ კი ისინი დასაქმდებიან GOA-ს აკადემიაში")



def goa_roles():
    print("""
💚 GOA-ში როლები და მათი მნიშვნელობა

დირექტორი — Nika Keshelava
აკადემიის დამფუძნებელი და მთავარი მენტორი.
განსაზღვრავს აკადემიის მიზნებს, ხედვას და სწავლების სტანდარტებს.
ატარებს მოტივაციურ სესიებს და შეხვედრებს წარმატებულ სტუდენტებთან.
ბოლო ეტაპზე სწორედ მასთან აბარებენ გასაუბრებას სტუდენტები.

მთავარი მენტორები (Mentors)
ხელმძღვანელობენ კონკრეტულ მიმართულებებს — მაგალითად:
Programming (Web, Game Dev)
Graphic Design
MMA / Fighting Discipline
აკონტროლებენ დამხმარე მენტორების მუშაობას.

დამხმარე მენტორები (Assistant Mentors)
მუშაობენ უშუალოდ სტუდენტებთან.
ახსნიან გაუგებარ თემებს, ეხმარებიან დავალებების შესრულებაში.
ამოწმებენ progress-ს თითოეული სტუდენტის დონეს.
სტუდენტებისთვის ისინი პირველ რიგში მეგობრები არიან, მერე მასწავლებლები

სტუდენტები (Students)
სწავლობენ დისციპლინით და გუნდურად.
მონაწილეობენ პროექტებში და Hackathon-ებში
წარმატებულები ხდებიან Elite Team-ის წევრები ან მომავალში მენტორები""")
    



# გვანცა მაზანიშვილი
def hackhathon():
    print("""
ჰაკათონი ეს არის შეჯიბრი
რომელიც ტარდება ერთ ან ორ თვეში ერთხელ.
ჰაკათონზე ბავშვები არა მარტი გამოამჟღავნებენ თავიანთ ცოდნას არამედ
მათ ეძლევათ შანსი რომ გახდნენ მოწინავე. 


ტერიტორიულად ჰაკათონი ტარდება მეტრო ტელისთან Rustavi 2- ის შენობაში 💚💚
""")


# ენრი შაქარიძე
def goa_payment():

    print("""
    რეგისტრაციის დასასრულებლად საჭიროა პირველი თვის საფასურის გადახდა. 
    თანხის ჩარიცხვის შემდეგ დაგამატებთ მშობლების ჩათში სადაც ყველანაირ სიახლეებზე იწერება ინფორმაცია,
    ასევე აირჩევთ დამხმარე მენტორსაც რომელიც, ინდივიდუალურად დაგეხმარებათ, გაუგებარ საკითხებს აგიხსნის და
    გასწავლით სად და როგორ უნდა შემოხვიდეთ ლექციაზე. 💬  
    
    
    ======================================
    🏦 საბანკო ინფორმაცია:
    ======================================
    🧡 საქართველოს ბანკი  
    👤 ნიკა ჩიქოვანი 
    🏦 ანგარიშის ნომერი: GE45BG0000000123456789
    
    💙 TBC ბანკი  
    👤 სოფო მარგველაშვილი 
    🏦 ანგარიშის ნომერი: GE66TB7734945123456789
    
    (დანიშნულებაში არაფრის მითითება არ არის საჭირო)
    ================================================
    """)

    bank = input("რომელი ბანკით გადაიხდით? (საქართველოს / თიბისი): ").lower()
    if "საქ" in bank or "geo" in bank:
        wirthdraw = int(input("შეიყვანეთ გადასახდელი თანხა ₾: "))
        print(f"წარმატებით გადაირიცხა {wirthdraw}₾ საქართველოს ბანკით ✅")
    elif "თიბ" in bank or "tbc" in bank:
        wirthdraw = int(input("შეიყვანეთ გადასახდელი თანხა ₾: "))
        print(f"წარმატებით გადაირიცხა {wirthdraw}₾ თიბისი ბანკით ✅")
    else:
        print("❌ არასწორი არჩევანი, სცადეთ თავიდან.")
        return

    print("""
    🧡 გადახდის შემდეგ ელექტრონული ან რეალური ქვითარი ჩამიგდეთ ყოველთვის,
    რათა არ გამომრჩეს ბაზაში აღრიცხვა 💚  
    გმადლობთ და ნაყოფიერ სწავლას გისურვებთ 💚.
    """)




def learning_type():
    print("""
    🟢 ჩვენ ვართ ონლაინ აკადემია - GOA (Goal Oriented Academy) 💚
    შეგიძლია ჩაერთო ნებისმიერი ადგილიდან, რადგან სწავლა არის ჰიბრიდულ რეჟიმში.
    გაკვეთილები ტარდება ონლაინ ან აუდიტორიულად.
    ასევე სემესტრში ტარდება:
        ▪ გასვლითი ექსკურსიები
        ▪ შემეცნებითი ლექციები
        ▪ გუნდური აქტივობები 💚
        """)

    print("💻 ონლაინ ჩართვისთვის საჭიროა კომპიუტერი ან ლეპტოპი.")

    print("""
    ===============================
    🟢 სწავლების ტიპი:
    ===============================
    1 ონლაინ რეჟიმი
    2 აუდიტორიული რეჟიმი
    """)
    
    choice = input("აირჩიეთ სწავლის ტიპი (1 ან 2): ")

    print("")

    if choice == "1":
        print("✅ თქვენ აირჩიეთ ონლაინ სწავლება.")
        print("""
    🗓  სწავლა დაიწყება 13 ნოემბერს
    🧑‍🏫 მინიმალური ასაკია: 9 წელი
    
    რაცშეეხება კვირაში გაკვეთილების რაოდენობას და ფასს:
    🟢 კვირაში 4-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 490 ლარი, ნაცვლად 860 ლარისა.
    🟢 კვირაში 3-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 390 ლარი, ნაცვლად 740 ლარისა.
    🟢 კვირაში 2-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 290 ლარი, ნაცვლად 560 ლარისა.
    🟢 კვირაში 1-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 170 ლარი, ნაცვლად 340 ლარისა.
        """)
    elif choice == "2":
        print("✅ თქვენ აირჩიეთ აუდიტორიული სწავლება.")
        print("""
    📍 ლექციები ჩატარდება თბილისში, საბურთალო, შარტავას 43-ში.
    🗓 სწავლა დაიწყება 22 ნოემბერს
    🧑‍🏫 მინიმალური ასაკია: 7 წელი
    
    რაცშეეხება კვირაში გაკვეთილების რაოდენობას და ფასს:
    🟢 კვირაში 3-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 540 ლარი, ნაცვლად 910 ლარისა.
    🟢 კვირაში 2-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 390 ლარი, ნაცვლად 730 ლარისა.
    🟢 კვირაში 1-ჯერ:-- კურსის ღირებულება არის ფასდაკლებით: თვეში 250 ლარი, ნაცვლად 440 ლარისა.
        """)
    else:
        print("❌ არასწორი არჩევანი, სცადეთ თავიდან")
    
    if choice == "1":
        choice2 = input("კვირაში რამდენჯერ შეგიძლიათ ონლაინ ჩართვა?: ")
        if choice2 == "1":
            print("✅ კიბატონო სწავლის ღირებულებაა 170 ლარი")
        elif choice2 == "2":
            print("✅ კიბატონო სწავლის ღირებულებაა 290 ლარი")
        elif choice2 == "3":
            print("✅ კიბატონო სწავლის ღირებულებაა 390 ლარი")
        elif choice2 == "4":
            print("✅ კიბატონო სწავლის ღირებულებაა 490 ლარი")
        else:
            print("❌ არასწორი არჩევანი, სცადეთ თავიდან")
    elif choice == "2":
        choice2 = input("კვირაში რამდენჯერ შეგიძლიათ აუდიტორიაში მოსვლა?: ")
        if choice2 == "1":
            print("✅ კიბატონო სწავლის ღირებულებაა 250 ლარი")
        elif choice2 == "2":
            print("✅ კიბატონო სწავლის ღირებულებაა 390 ლარი")
        elif choice2 == "3":
            print("✅ კიბატონო სწავლის ღირებულებაა 540 ლარი")
        else:
            print("❌ არასწორი არჩევანი, სცადეთ თავიდან")

    print("""
    🟢საბაზისო ეტაპის ხანგრძლივობა არის 1 წელი, ხოლო სიღრმისეული კურსი - 2.5 წელი.
    🎓 კურსის დასრულების შემდეგ მიიღებთ GOA-ს ოფიციალურ სერტიფიკატს 📜
    
    🚀 წარმატებული სტუდენტები გაივლიან ტექნიკურ გასაუბრებას ბატონ Nika Keshelava -სთან და
    დასაქმდებიან Goal-Oriented Academy • GOA-ში & პარტნიორ კომპანიებში. 💼
        """)
    

def min_age():
    print("""
📅 მინიმალური ასაკის მოთხოვნები GOA-ში:
======================================
🏢 აუდიტორიული სწავლა — მინ. ასაკი: 7 წელი
💻 ონლაინ სწავლა — მინ. ასაკი: 9 წელი
======================================
ხოლო რაც შეეხება მაქს. ასაკი: შეზღუდვა არ არსებობს.
""")
    
    
# ასარჩევი გრაფა


if choice == "1":
    quiz_math()
elif choice == "2":
    english_quiz()
elif choice == "3":
    programming_quiz()
elif choice == "4":
    graphic_design()
elif choice == "5":
    mma_page()
elif choice == "6":
    basic_course()
elif choice == "7":
    goa_roles()
elif choice == "8":
    hackhathon()
elif choice == "9":
    goa_payment()
elif choice == "10":
    learning_type()
elif choice == "11":
    min_age()